In [1]:
# https://ipython.readthedocs.io/en/stable/config/extensions/autoreload.html?highlight=autoreload
%load_ext autoreload

%autoreload 2

In [2]:
import gc
import numpy as np
import os
import pandas as pd
import sqlalchemy

# Local imports
import imdb
import transform

# MySQL parameters

Increase general performance:
* --innodb-buffer-pool-size=2147483648  (2G)
* --innodb-buffer-pool-instances=8 

Increase write performance:
* --innodb-log-file-size=536870912    (512MB)(Assuming 2 file groups)

# Useful resources

1. [How to Work with BIG Datasets on Kaggle Kernels (16G RAM)](https://www.kaggle.com/yuliagm/how-to-work-with-big-datasets-on-16g-ram-dask)
1. [Using pandas with large data](https://www.dataquest.io/blog/pandas-big-data/)
1. [14.8.3.1 Configuring InnoDB Buffer Pool Size](https://dev.mysql.com/doc/refman/5.7/en/innodb-buffer-pool-resize.html)
1. [innodb-log-file-size](https://dev.mysql.com/doc/refman/8.0/en/innodb-parameters.html#sysvar_innodb_log_file_size)
1. [13.2.7 LOAD DATA INFILE Syntax](https://dev.mysql.com/doc/refman/8.0/en/load-data.html#load-data-duplicate-key-handling)

In [3]:
data_folder = './imdb'

if not os.path.exists(data_folder):
    os.mkdir(data_folder)

def save_csv(df, file):
    filename = os.path.join(data_folder, file)
    df.to_csv(filename, index=False)

In [4]:
mysql_url = 'mysql+pymysql://imdb:imdb@localhost:3306/imdb'
engine = sqlalchemy.create_engine(mysql_url)

def df_to_mysql(df, table_name, delete_before=True):
    
    if delete_before:
        # Delete table before adding new rows
        connection = engine.connect()
        trans = connection.begin()
        connection.execute('SET FOREIGN_KEY_CHECKS = 0;')
        stmt = 'TRUNCATE {};'.format(table_name)
        print(stmt)
        connection.execute(stmt)
        connection.execute('SET FOREIGN_KEY_CHECKS = 1;')
        trans.commit()
        connection.close()
        print('Table {} deleted'.format(table_name))
        
    df.to_sql(table_name, con=engine, if_exists='append', index=False, chunksize=10**4)

# Name_basics

In [5]:
name_basics = imdb.name_basics_df()

In [6]:
name_basics_pre = name_basics.copy()

# nconst to int
name_basics_pre['nconst'] = transform.nconst_to_float(name_basics_pre['nconst'])

# Preserve nconst
name_basics_nconst = name_basics_pre['nconst'].copy()

name_basics_pre.info(memory_usage='deep')
name_basics_pre.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9004834 entries, 0 to 9004833
Data columns (total 6 columns):
nconst               uint32
primaryName          object
birthYear            float64
deathYear            float64
primaryProfession    object
knownForTitles       object
dtypes: float64(2), object(3), uint32(1)
memory usage: 1.9 GB

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,1,Fred Astaire,1899.0,1987.0,"soundtrack,actor,miscellaneous","tt0043044,tt0050419,tt0053137,tt0072308"
1,2,Lauren Bacall,1924.0,2014.0,"actress,soundtrack","tt0037382,tt0038355,tt0117057,tt0071877"
2,3,Brigitte Bardot,1934.0,NaN,"actress,soundtrack,producer","tt0059956,tt0049189,tt0054452,tt0057345"
3,4,John Belushi,1949.0,1982.0,"actor,writer,soundtrack","tt0078723,tt0080455,tt0077975,tt0072562"
4,5,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0060827"

In [65]:
%%timeit -n 1 -r 1

df_to_mysql(name_basics_pre, 'name_basics')

#save_csv(name_basics_pre, 'name_basics.csv')

Table name_basics deleted
5min 3s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [7]:
del name_basics
del name_basics_pre
gc.collect()

0

# title_basics

In [8]:
title_basics = imdb.title_basics_df()

In [9]:
title_basics_pre = title_basics.copy()

title_basics_pre['tconst'] = transform.tconst_to_float(title_basics_pre['tconst'])

# Preserve tconst for future filterings
title_basics_tconst = title_basics_pre['tconst'].copy()

title_basics_pre.info()
title_basics_pre.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5465783 entries, 0 to 5465782
Data columns (total 9 columns):
tconst            uint32
titleType         object
primaryTitle      object
originalTitle     object
isAdult           int64
startYear         float64
endYear           float64
runtimeMinutes    float64
genres            object
dtypes: float64(3), int64(1), object(4), uint32(1)
memory usage: 354.5+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,1,short,Carmencita,Carmencita,0,1894.0,NaN,1.0,"Documentary,Short"
1,2,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5.0,"Animation,Short"
2,3,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4.0,"Animation,Comedy,Romance"
3,4,short,Un bon bock,Un bon bock,0,1892.0,NaN,NaN,"Animation,Short"
4,5,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1.0,"Comedy,Short"

In [69]:
%%timeit -n 1 -r 1

df_to_mysql(title_basics_pre, 'title_basics')

# save_csv(title_basics_pre, 'title_basics.csv')

Table title_basics deleted
4min 11s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [10]:
del title_basics
del title_basics_pre
gc.collect()

20

# title_akas

In [7]:
title_akas = imdb.title_akas_df()
title_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0
1,tt0000001,2,Карменсита,RU,NaN,NaN,NaN,0.0
2,tt0000001,3,Carmencita,US,NaN,NaN,NaN,0.0
3,tt0000001,4,Carmencita,NaN,NaN,original,NaN,1.0
4,tt0000002,1,Le clown et ses chiens,NaN,NaN,original,NaN,1.0

In [8]:
title_akas_pre = title_akas.copy()
title_akas_pre['titleId'] = transform.tconst_to_float(title_akas_pre['titleId'])
print('Shape', title_akas_pre.shape)

# Remove title_akas for non-existing# title_basic
title_akas_pre = title_akas_pre[title_akas_pre['titleId'].isin(title_basics_pre['tconst'])]

print('Shape', title_akas_pre.shape)
title_akas_pre.head()

Shape (3699803, 8)
Shape (3695781, 8)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,1.0,1,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0
1,1.0,2,Карменсита,RU,NaN,NaN,NaN,0.0
2,1.0,3,Carmencita,US,NaN,NaN,NaN,0.0
3,1.0,4,Carmencita,NaN,NaN,original,NaN,1.0
4,2.0,1,Le clown et ses chiens,NaN,NaN,original,NaN,1.0

In [13]:
%%timeit -n 1 -r 1

df_to_mysql(title_akas_pre, 'title_akas')

#save_csv(title_akas_pre, 'title_akas.csv')

TRUNCATE title_akas;
Table title_akas deleted
TRUNCATE title_akas;
Table title_akas deleted
TRUNCATE title_akas;
Table title_akas deleted
2min 23s ± 0 ns per loop (mean ± std. dev. of 1 run, 3 loops each)

# title_crew

In [9]:
title_crew = imdb.title_crew_df()

In [10]:
title_crew_director = title_crew[['tconst', 'directors']].copy()
title_crew_writer = title_crew[['tconst', 'writers']].copy()

# Drop rows with null values
title_crew_director.dropna(inplace=True)

title_crew_writer.dropna(inplace=True)

# Expand rows based on directors and writers list
title_crew_director['directors'] = title_crew_director['directors'].astype('str')
title_crew_director = transform.expand_rows_using_repeat(title_crew_director, 'directors', ',')
title_crew_director.rename(index=str, columns={"directors": "director"}, inplace=True)

title_crew_writer['writers'] = title_crew_writer['writers'].astype('str')
title_crew_writer = transform.expand_rows_using_repeat(title_crew_writer, 'writers', ',')
title_crew_writer.rename(index=str, columns={"writers": "writer"}, inplace=True)

# Transform identifiers
title_crew_director['tconst'] = transform.tconst_to_float(title_crew_director['tconst'])
title_crew_director['director'] = transform.nconst_to_float(title_crew_director['director'])

title_crew_writer['tconst'] = transform.tconst_to_float(title_crew_writer['tconst'])
title_crew_writer['writer'] = transform.nconst_to_float(title_crew_writer['writer'])

# Remove rows for non-existing titles or names
title_crew_director = title_crew_director[title_crew_director['director'].isin(name_basics_nconst)]
title_crew_writer = title_crew_writer[title_crew_writer['writer'].isin(name_basics_nconst)]


title_crew_director.info(memory_usage='deep')
title_crew_director.head()

<class 'pandas.core.frame.DataFrame'>
Index: 4073178 entries, 0 to 4073188
Data columns (total 2 columns):
tconst      uint32
director    uint32
dtypes: uint32(2)
memory usage: 278.6 MB

   tconst  director
0       1      5690
1       2    721526
2       3    721526
3       4    721526
4       5      5690
5       6      5690
6       7      5690
7       7    374658
8       8      5690
9       9     85156

In [11]:
title_crew_writer.info(memory_usage='deep')
title_crew_writer.head()

<class 'pandas.core.frame.DataFrame'>
Index: 6239566 entries, 0 to 6239588
Data columns (total 2 columns):
tconst    uint32
writer    uint32
dtypes: uint32(2)
memory usage: 427.4 MB

   tconst  writer
0       9   85156
1      36  410331
2      76  410331
3      91  617588
4     108  410331
5     109  410331
6     110  410331
7     111  410331
8     112  410331
9     113  410331

In [14]:
%%timeit -n 1 -r 1

df_to_mysql(title_crew_director, 'title_crew_director')

TRUNCATE title_crew_director;
Table title_crew_director deleted
25min 25s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [15]:
%%timeit -n 1 -r 1

df_to_mysql(title_crew_writer, 'title_crew_writer')

TRUNCATE title_crew_writer;
Table title_crew_writer deleted
9min 57s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [17]:
del title_crew_director
del title_crew_writer
gc.collect()

NameError: name 'title_crew' is not defined

# title_episode

In [12]:
title_episode = imdb.title_episode_df()

In [13]:
title_episode_pre = title_episode.copy()

# Transform identifiers
title_episode_pre['tconst'] = transform.tconst_to_float(title_episode_pre['tconst'])
title_episode_pre['parentTconst'] = transform.tconst_to_float(title_episode_pre['parentTconst'])

# Remove rows for non-existing titles
title_episode_pre = title_episode_pre[(title_episode_pre['tconst'].isin(title_basics_tconst))]
title_episode_pre = title_episode_pre[title_episode_pre['parentTconst'].isin(title_basics_tconst)]

title_episode_pre.info(memory_usage='deep')
title_episode_pre.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3735207 entries, 0 to 3735227
Data columns (total 4 columns):
tconst           uint32
parentTconst     uint32
seasonNumber     float64
episodeNumber    float64
dtypes: float64(2), uint32(2)
memory usage: 114.0 MB

   tconst  parentTconst  seasonNumber  episodeNumber
0   41951         41038           1.0            9.0
1   42816        989125           1.0           17.0
2   42889        989125           NaN            NaN
3   43426         40051           3.0           42.0
4   43631        989125           2.0           16.0

In [21]:
%%timeit -n 1 -r 1

df_to_mysql(title_episode_pre, 'title_episode')

#save_csv(title_episode_pre, 'title_episode.csv')

TRUNCATE title_episode;
Table title_episode deleted
2min 6s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [22]:
del title_episode
del title_episode_pre
gc.collect()

93

# title_principals

In [11]:
title_principals = imdb.title_principals_df()

In [12]:
title_principals_pre = title_principals.copy()

# Transform identifiers
title_principals_pre['tconst'] = transform.tconst_to_float(title_principals_pre['tconst'])
title_principals_pre['nconst'] = transform.nconst_to_float(title_principals_pre['nconst'])

title_principals_pre['tconst'] = pd.to_numeric(title_principals_pre['tconst'], downcast='unsigned')

# Remove rows for non-existing titles
title_principals_pre = title_principals_pre[title_principals_pre['tconst'].isin(title_basics_tconst)]
title_principals_pre = title_principals_pre[title_principals_pre['nconst'].isin(name_basics_nconst)]

title_principals_pre.info(memory_usage='deep')
title_principals_pre.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31199858 entries, 0 to 31211514
Data columns (total 6 columns):
tconst        uint32
ordering      uint8
nconst        uint32
category      category
job           category
characters    object
dtypes: category(2), object(1), uint32(2), uint8(1)
memory usage: 2.2 GB

,tconst,ordering,nconst,category,job,characters
0,1,1,1588970,self,NaN,"[""Herself""]"
1,1,2,5690,director,NaN,NaN
2,1,3,374658,cinematographer,director of photography,NaN
3,2,1,721526,director,NaN,NaN
4,2,2,1335271,composer,NaN,NaN

In [13]:
%%timeit -n 1 -r 1

df_to_mysql(title_principals_pre, 'title_principals')

#save_csv(title_principals_pre, 'title_principals.csv')

TRUNCATE title_principals;
Table title_principals deleted
49min 5s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [15]:
del title_principals
del title_principals_pre
gc.collect()

3188

# title_ratings

In [23]:
title_ratings = imdb.title_ratings_df()

In [24]:
title_ratings_pre = title_ratings.copy()

# Transform identifiers
title_ratings_pre['tconst'] = transform.tconst_to_float(title_ratings_pre['tconst'])

title_ratings_pre.info(memory_usage='deep')
title_ratings_pre.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 897434 entries, 0 to 897433
Data columns (total 3 columns):
tconst           897434 non-null uint32
averageRating    897434 non-null float64
numVotes         897434 non-null int64
dtypes: float64(1), int64(1), uint32(1)
memory usage: 17.1 MB

   tconst  averageRating  numVotes
0       1            5.8      1443
1       2            6.4       174
2       3            6.6      1045
3       4            6.4       104
4       5            6.2      1741

In [25]:
%%timeit -n 1 -r 1

df_to_mysql(title_ratings_pre, 'title_ratings')

#save_csv(title_ratings_pre, 'title_ratings.csv')

TRUNCATE title_ratings;
Table title_ratings deleted
24.7 s ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [8]:
del title_ratings
del title_ratings_pre
gc.collect()

0